hw4/app/controllers/movies_controller.rb

  def search_director
    @movies = Movie.find_with_same_director(params[:id])
    if @movies.blank?
      title = Movie.find(params[:id]).title
---
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 21]]